zaoshuizaoxing/JD6628-Eight_Port/Drivers/PY32F031_HAL_Driver/Inc/py32f031_hal_rcc.h
#define IS_RCC_LSI(__LSI__)               (((__LSI__) == RCC_LSI_OFF) || ((__LSI__) == RCC_LSI_ON))

#if defined(RCC_PLL_SUPPORT)
#define IS_RCC_PLL(__PLL__)               (((__PLL__) == RCC_PLL_NONE) ||((__PLL__) == RCC_PLL_OFF) || \
                                           ((__PLL__) == RCC_PLL_ON))

#if defined(RCC_HSE_SUPPORT)
#define IS_RCC_PLLSOURCE(__SOURCE__)      (((__SOURCE__) == RCC_PLLSOURCE_HSI)  || \
                                           ((__SOURCE__) == RCC_PLLSOURCE_HSE))
#else
#define IS_RCC_PLLSOURCE(__SOURCE__)      ((__SOURCE__) == RCC_PLLSOURCE_HSI)                                         
#endif

#define IS_RCC_PLL_MUL(__MUL__)            (((__MUL__) == RCC_PLL_MUL2) || \
                                           ((__MUL__) == RCC_PLL_MUL3))
#endif
                                         
#define IS_RCC_CLOCKTYPE(__CLK__)         ((((__CLK__) & RCC_CLOCKTYPE_ALL) != 0x00UL) && (((__CLK__) & ~RCC_CLOCKTYPE_ALL) == 0x00UL))
#if defined(RCC_LSE_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSE)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK))
#elif defined(RCC_HSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK))
#elif defined(RCC_LSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSE)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK))
#else
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI)  || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK))                                                                                        
#endif

#define IS_RCC_HCLK(__HCLK__)             (((__HCLK__) == RCC_SYSCLK_DIV1)   || ((__HCLK__) == RCC_SYSCLK_DIV2)   || \
                                           ((__HCLK__) == RCC_SYSCLK_DIV4)   || ((__HCLK__) == RCC_SYSCLK_DIV8)   || \
                                           ((__HCLK__) == RCC_SYSCLK_DIV16)  || ((__HCLK__) == RCC_SYSCLK_DIV64)  || \
                                           ((__HCLK__) == RCC_SYSCLK_DIV128) || ((__HCLK__) == RCC_SYSCLK_DIV256) || \
                                           ((__HCLK__) == RCC_SYSCLK_DIV512))

#define IS_RCC_PCLK(__PCLK__)             (((__PCLK__) == RCC_HCLK_DIV1) || ((__PCLK__) == RCC_HCLK_DIV2) || \
                                           ((__PCLK__) == RCC_HCLK_DIV4) || ((__PCLK__) == RCC_HCLK_DIV8) || \
                                           ((__PCLK__) == RCC_HCLK_DIV16))
#if defined(RCC_LSE_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSE) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV128))
#elif defined(RCC_HSE_SUPPORT)
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV128))
#elif defined(RCC_LSE_SUPPORT)
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSE))
#else
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI))
#endif

#define IS_RCC_MCO(__MCOX__)              (((__MCOX__) == RCC_MCO1) || \
                                           ((__MCOX__) == RCC_MCO2) || \
                                           ((__MCOX__) == RCC_MCO3) || \
                                           ((__MCOX__) == RCC_MCO4) || \
                                           ((__MCOX__) == RCC_MCO5) || \
                                           ((__MCOX__) == RCC_MCO6) || \
                                           ((__MCOX__) == RCC_MCO7) || \
                                           ((__MCOX__) == RCC_MCO8))

#if defined(RCC_LSE_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK))
#elif defined(RCC_HSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK))
#elif defined(RCC_LSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK))
#else
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK))                                                                             
#endif

